In [49]:
import pandas as pd

## create python dict and convert to pandas data frame

In [50]:
data={"oranges":[2,8,9,6,7], "apple":[3,8,2,1,6], "banana":[5,6,1,3,2]}

In [51]:
data

{'oranges': [2, 8, 9, 6, 7],
 'apple': [3, 8, 2, 1, 6],
 'banana': [5, 6, 1, 3, 2]}

In [52]:
dataFrame1=pd.DataFrame(data,index=["Sekina","Bo","Galo","Noah","Toma"])

In [53]:
dataFrame1

        oranges  apple  banana
Sekina        2      3       5
Bo            8      8       6
Galo          9      2       1
Noah          6      1       3
Toma          7      6       2

In [54]:
a=dataFrame1["apple"]

In [55]:
a

Sekina    3
Bo        8
Galo      2
Noah      1
Toma      6
Name: apple, dtype: int64

In [56]:
type(a)

pandas.core.series.Series

In [57]:
b=dataFrame1.oranges

In [58]:
b

Sekina    2
Bo        8
Galo      9
Noah      6
Toma      7
Name: oranges, dtype: int64

## explore methods in data frames

In [59]:
c=dataFrame1.columns

In [60]:
type(c)

pandas.core.indexes.base.Index

## using in place argument in a method in adata frame/ sries it replaces the original memory storage locations ie replaces the previous dataframe

In [64]:
dataFrame1.rename({'apple':"lemon"},axis='columns',inplace=True)

In [62]:
x=dataFrame1["apple"]

In [66]:
dataFrame1

        oranges  lemon  banana
Sekina        2      3       5
Bo            8      8       6
Galo          9      2       1
Noah          6      1       3
Toma          7      6       2

In [73]:
o=dataFrame1['oranges']

In [69]:
o

Sekina    2
Bo        8
Galo      9
Noah      6
Toma      7
Name: oranges, dtype: int64

In [70]:
o.Toma

7

## we use loc method to get row index

In [79]:
dataFrame1.loc['Toma',['oranges','lemon','banana']]

oranges    7
lemon      6
banana     2
Name: Toma, dtype: int64

In [86]:
o=dataFrame1[['oranges','lemon']]

In [88]:
o

        oranges  lemon
Sekina        2      3
Bo            8      8
Galo          9      2
Noah          6      1
Toma          7      6

In [87]:
type(o)

pandas.core.frame.DataFrame

In [95]:
dataFrame1.loc[['Toma',"Sekina"]][['oranges','lemon']]

        oranges  lemon
Toma          7      6
Sekina        2      3